---
kind: type
id: T:Autodesk.Revit.UI.Events.RibbonItemEventArgs
source: html/d20e0334-3b7a-35ed-bbcb-5e6807f46f84.htm
---
# Autodesk.Revit.UI.Events.RibbonItemEventArgs

The base class of the RibbonItem event arguments which have UIApplication property.

## Syntax (C#)
```csharp
public class RibbonItemEventArgs : EventArgs
```